window.SCHEDULE_DATA = {
  "periods": {
    "1": [
      "08:30",
      "09:10"
    ],
    "2": [
      "09:15",
      "09:55"
    ],
    "3": [
      "10:10",
      "10:50"
    ],
    "4": [
      "10:55",
      "11:35"
    ],
    "5": [
      "11:35",
      "13:05"
    ],
    "6": [
      "13:10",
      "13:50"
    ],
    "7": [
      "13:55",
      "14:35"
    ],
    "8": [
      "14:45",
      "15:25"
    ],
    "9": [
      "15:30",
      "16:10"
    ],
    "10": [
      "16:15",
      "16:55"
    ],
    "11": [
      "18:00",
      "18:40"
    ],
    "12": [
      "18:45",
      "19:25"
    ],
    "13": [
      "19:30",
      "20:10"
    ]
  },
  "courses": [
    {
      "id": "adv-chinese",
      "zh": "高级汉语（Ⅲ）",
      "en": "Advanced Chinese (III)",
      "th": "ภาษาจีนขั้นสูง (III)",
      "teacher": "闻齐家",
      "occ": [
        {
          "d": 1,
          "w": "5-16",
          "p": [
            2,
            3,
            4
          ],
          "room": "南6A502",
          "weeks": [
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15,
            16
          ],
          "start": "09:15",
          "end": "11:35"
        },
        {
          "d": 1,
          "w": "1-2",
          "p": [
            7,
            8,
            9
          ],
          "room": "南6A508",
          "weeks": [
            1,
            2
          ],
          "start": "13:55",
          "end": "16:10"
        },
        {
          "d": 4,
          "w": "1-2,4-16",
          "p": [
            8,
            9
          ],
          "room": "南6B309",
          "weeks": [
            1,
            2,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15,
            16
          ],
          "start": "14:45",
          "end": "16:10"
        },
        {
          "d": 5,
          "w": "1,2,4-7,14-15",
          "p": [
            2,
            3,
            4
          ],
          "room": "南6A309",
          "weeks": [
            1,
            2,
            4,
            5,
            6,
            7,
            14,
            15
          ],
          "start": "09:15",
          "end": "11:35"
        }
      ]
    },
    {
      "id": "orientation",
      "zh": "始业教育",
      "en": "Students' Orientation Education",
      "th": "ปฐมนิเทศนักศึกษา",
      "teacher": "万朵",
      "occ": [
        {
          "d": 1,
          "w": "3",
          "p": [
            1,
            2,
            3,
            4
          ],
          "room": "富春北图书馆二楼报告厅",
          "weeks": [
            3
          ],
          "start": "08:30",
          "end": "11:35"
        },
        {
          "d": 2,
          "w": "3",
          "p": [
            1,
            2,
            3,
            4
          ],
          "room": "富春北图书馆二楼报告厅",
          "weeks": [
            3
          ],
          "start": "08:30",
          "end": "11:35"
        },
        {
          "d": 2,
          "w": "3",
          "p": [
            6,
            7,
            8,
            9,
            10
          ],
          "room": "富春北图书馆二楼报告厅",
          "weeks": [
            3
          ],
          "start": "13:10",
          "end": "16:55"
        },
        {
          "d": 6,
          "w": "3",
          "p": [
            7,
            8,
            9
          ],
          "room": "网课",
          "weeks": [
            3
          ],
          "start": "13:55",
          "end": "16:10"
        }
      ]
    },
    {
      "id": "tcm-theory",
      "zh": "中医基础理论",
      "en": "Basic Theory of Traditional Chinese Medicine",
      "th": "ทฤษฎีพื้นฐานการแพทย์แผนจีน",
      "teacher": "张天星",
      "occ": [
        {
          "d": 2,
          "w": "1-2,9-17",
          "p": [
            3,
            4
          ],
          "room": "南6A206",
          "weeks": [
            1,
            2,
            9,
            10,
            11,
            12,
            13,
            14,
            15,
            16,
            17
          ],
          "start": "10:10",
          "end": "11:35"
        },
        {
          "d": 2,
          "w": "3-8",
          "p": [
            3,
            4
          ],
          "room": "慕课自主学习",
          "weeks": [
            3,
            4,
            5,
            6,
            7,
            8
          ],
          "start": "10:10",
          "end": "11:35"
        },
        {
          "d": 4,
          "w": "1-10,12-17",
          "p": [
            3,
            4
          ],
          "room": "南6B204",
          "weeks": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            12,
            13,
            14,
            15,
            16,
            17
          ],
          "start": "10:10",
          "end": "11:35"
        },
        {
          "d": 4,
          "w": "11",
          "p": [
            3,
            4
          ],
          "room": "慕课自主学习",
          "weeks": [
            11
          ],
          "start": "10:10",
          "end": "11:35"
        }
      ]
    },
    {
      "id": "study-china",
      "zh": "留学中国",
      "en": "Study in China ABC",
      "th": "เรียนต่อประเทศจีน",
      "teacher": "罗丹曦",
      "occ": [
        {
          "d": 3,
          "w": "3,5-7",
          "p": [
            1,
            2,
            3,
            4
          ],
          "room": "南6A206",
          "weeks": [
            3,
            5,
            6,
            7
          ],
          "start": "08:30",
          "end": "11:35"
        },
        {
          "d": 3,
          "w": "8-9",
          "p": [
            1,
            2,
            3,
            4
          ],
          "room": "慕课自主学习",
          "weeks": [
            8,
            9
          ],
          "start": "08:30",
          "end": "11:35"
        }
      ]
    },
    {
      "id": "biochem",
      "zh": "生物化学B",
      "en": "Biochemistry B",
      "th": "ชีวเคมี B",
      "teacher": "陈晓玲",
      "occ": [
        {
          "d": 3,
          "w": "8,11",
          "p": [
            2,
            3,
            4
          ],
          "room": "网课",
          "weeks": [
            8,
            11
          ],
          "start": "09:15",
          "end": "11:35"
        },
        {
          "d": 3,
          "w": "9-10,12-15",
          "p": [
            2,
            3,
            4
          ],
          "room": "南6A206",
          "weeks": [
            9,
            10,
            12,
            13,
            14,
            15
          ],
          "start": "09:15",
          "end": "11:35"
        },
        {
          "d": 3,
          "w": "16",
          "p": [
            3,
            4
          ],
          "room": "南6A206",
          "weeks": [
            16
          ],
          "start": "10:10",
          "end": "11:35"
        },
        {
          "d": 5,
          "w": "13",
          "p": [
            1,
            2,
            3,
            4
          ],
          "room": "5B508",
          "weeks": [
            13
          ],
          "start": "08:30",
          "end": "11:35"
        },
        {
          "d": 2,
          "w": "1-2,5-10",
          "p": [
            6,
            7,
            8
          ],
          "room": "南6B307",
          "weeks": [
            1,
            2,
            5,
            6,
            7,
            8,
            9,
            10
          ],
          "start": "13:10",
          "end": "15:25"
        },
        {
          "d": 5,
          "w": "5",
          "p": [
            6,
            7
          ],
          "room": "网课",
          "weeks": [
            5
          ],
          "start": "13:10",
          "end": "14:35"
        },
        {
          "d": 5,
          "w": "13",
          "p": [
            6,
            7,
            8,
            9,
            10
          ],
          "room": "5B508",
          "weeks": [
            13
          ],
          "start": "13:10",
          "end": "16:55"
        },
        {
          "d": 5,
          "w": "13",
          "p": [
            11,
            12,
            13
          ],
          "room": "南5B508",
          "weeks": [
            13
          ],
          "start": "18:00",
          "end": "20:10"
        }
      ]
    },
    {
      "id": "taijiquan",
      "zh": "太极拳",
      "en": "Taijiquan (The Chinese Shadowboxing)",
      "th": "ไทเก็ก",
      "teacher": "赵奕旸",
      "occ": [
        {
          "d": 4,
          "w": "1-16",
          "p": [
            1,
            2
          ],
          "room": "操场",
          "weeks": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15,
            16
          ],
          "start": "08:30",
          "end": "09:55"
        }
      ]
    },
    {
      "id": "chinese-overview",
      "zh": "中国概况（Ⅰ）",
      "en": "Chinese Overview (I)",
      "th": "ภาพรวมประเทศจีน (I)",
      "teacher": "林洁",
      "occ": [
        {
          "d": 1,
          "w": "5-14",
          "p": [
            6,
            7,
            8
          ],
          "room": "南6A311",
          "weeks": [
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14
          ],
          "start": "13:10",
          "end": "15:25"
        },
        {
          "d": 2,
          "w": "15",
          "p": [
            11,
            12
          ],
          "room": "网课",
          "weeks": [
            15
          ],
          "start": "18:00",
          "end": "19:25"
        }
      ]
    },
    {
      "id": "tcm-chinese",
      "zh": "中医汉语（Ⅰ）",
      "en": "TCM Chinese (I)",
      "th": "ภาษาจีนการแพทย์แผนจีน (I)",
      "teacher": "崔小强",
      "occ": [
        {
          "d": 3,
          "w": "1-3,5-11",
          "p": [
            7,
            8,
            9
          ],
          "room": "南6B403",
          "weeks": [
            1,
            2,
            3,
            5,
            6,
            7,
            8,
            9,
            10,
            11
          ],
          "start": "13:55",
          "end": "16:10"
        },
        {
          "d": 3,
          "w": "12",
          "p": [
            7,
            8
          ],
          "room": "南6B403",
          "weeks": [
            12
          ],
          "start": "13:55",
          "end": "15:25"
        }
      ]
    },
    {
      "id": "science-tcm",
      "zh": "科学走近中医",
      "en": "Scientific Introduction of Chinese Medicine",
      "th": "วิทยาศาสตร์สู่การแพทย์แผนจีน",
      "teacher": "张铭珈",
      "occ": [
        {
          "d": 4,
          "w": "2-3,11,14",
          "p": [
            6,
            7
          ],
          "room": "慕课自主学习",
          "weeks": [
            2,
            3,
            11,
            14
          ],
          "start": "13:10",
          "end": "14:35"
        },
        {
          "d": 4,
          "w": "1,4-10,12-13,15-17",
          "p": [
            6,
            7
          ],
          "room": "南6B507",
          "weeks": [
            1,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            12,
            13,
            15,
            16,
            17
          ],
          "start": "13:10",
          "end": "14:35"
        }
      ]
    },
    {
      "id": "psych-health",
      "zh": "大学生心理健康教育",
      "en": "Psychological Health Education",
      "th": "สุขภาพจิตนักศึกษา",
      "teacher": "",
      "occ": [
        {
          "d": 3,
          "w": "13",
          "p": [
            11,
            12
          ],
          "room": "南6A211",
          "weeks": [
            13
          ],
          "start": "18:00",
          "end": "19:25"
        },
        {
          "d": 5,
          "w": "6,17",
          "p": [
            6,
            7
          ],
          "room": "南6A411",
          "weeks": [
            6,
            17
          ],
          "start": "13:10",
          "end": "14:35"
        },
        {
          "d": 5,
          "w": "7-9,14-15",
          "p": [
            6,
            7,
            8
          ],
          "room": "南6A411",
          "weeks": [
            7,
            8,
            9,
            14,
            15
          ],
          "start": "13:10",
          "end": "15:25"
        },
        {
          "d": 5,
          "w": "4-5,10",
          "p": [
            11,
            12,
            13
          ],
          "room": "南6A411",
          "weeks": [
            4,
            5,
            10
          ],
          "start": "18:00",
          "end": "20:10"
        },
        {
          "d": 5,
          "w": "11",
          "p": [
            11,
            12
          ],
          "room": "南6A411",
          "weeks": [
            11
          ],
          "start": "18:00",
          "end": "19:25"
        }
      ]
    },
    {
      "id": "intercultural",
      "zh": "跨文化交际学",
      "en": "Intercultural Communication",
      "th": "การสื่อสารระหว่างวัฒนธรรม",
      "teacher": "陈晔",
      "occ": [
        {
          "d": 2,
          "w": "5-7,9-12,14",
          "p": [
            11,
            12,
            13
          ],
          "room": "南6A311",
          "weeks": [
            5,
            6,
            7,
            9,
            10,
            11,
            12,
            14
          ],
          "start": "18:00",
          "end": "20:10"
        },
        {
          "d": 2,
          "w": "16",
          "p": [
            11,
            12
          ],
          "room": "南6A311",
          "weeks": [
            16
          ],
          "start": "18:00",
          "end": "19:25"
        },
        {
          "d": 3,
          "w": "14-15",
          "p": [
            11,
            12,
            13
          ],
          "room": "南6A311",
          "weeks": [
            14,
            15
          ],
          "start": "18:00",
          "end": "20:10"
        }
      ]
    }
  ]
};